<a href="https://colab.research.google.com/github/HarshadaDesai007/CourseWork-Programming-Module-/blob/main/Class7.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
def print_menu():
    print("**********Welcome to the online Banking system***********")
    print('1. Show customers')
    print('2. Add an account')
    print('3. Remove a customer')
    print('4. Deposit money')
    print('5. Withdraw money')
    print('6. Quit')
    print()

numbers = {}
menu_choice = 0
print_menu()
while menu_choice != 5:
  menu_choice = int(input("Type in a number (1-5): "))
  if menu_choice == 1:
        print("Account deatils :")
        for x in numbers.keys():
            print("Name: ", x, "\t Balance:", numbers[x])
        print()
  elif menu_choice == 2:   
        print("Add Name and Balance")
        name = input("Name:")
        balance = int(input("Balance:"))
        numbers[name] = balance
  elif menu_choice == 3:
        print("Remove Customer")
        name = input("Name:")
        if name in numbers:
            del numbers[name]
        else:
            print(name, "was not found")
  elif menu_choice == 4:
        balance=0
        print("Deposit money")
        name = input("Name:")
        deposit = int(input("Enter money to deposit"))
        if name in numbers:
            print("The balance is", numbers[name])
            numbers[name]+=deposit
            print("The new balance is", numbers[name])
        else:
            print(name, "Record was not found")

  elif menu_choice == 5:
        balance=0
        print("Withdraw money")
        name = input("Name:")
        withdraw = int(input("Enter money to withdraw"))
        if name in numbers:
            print("The balance is", numbers[name])
            if withdraw<balance:
              numbers[name]-=withdraw
            else:
              print("Cannot withdraw amount")
            
            print("The new balance is", numbers[name])
        else:
            print(name, "Record was not found")
        
  elif menu_choice != 6:
        print_menu()

**********Welcome to the online Banking system***********
1. Show customers
2. Add an account
3. Remove a customer
4. Deposit money
5. Withdraw money
6. Quit

Type in a number (1-5): 2
Add Name and Balance
Name:
Balance:100
Type in a number (1-5): 5
Withdraw money
Name:
Enter money to withdraw100
The balance is 100
Cannot withdraw amount
The new balance is 100

In [ ]:
q! pip install db-sqlite3

Requirement already satisfied: db-sqlite3 in /usr/local/lib/python3.6/dist-packages (0.0.1)
Requirement already satisfied: db in /usr/local/lib/python3.6/dist-packages (from db-sqlite3) (0.1.1)
Requirement already satisfied: antiorm in /usr/local/lib/python3.6/dist-packages (from db->db-sqlite3) (1.2.1)

In [ ]:
import pandas as pd
import sqlite3
from datetime import time

In [ ]:
db = sqlite3.connect("Abhi_testing.db")
db.execute("drop table if exists results")
try:
  db.execute("create table results(Name text , Mobile text, Mail text)")
except:
  print("Already exists!")

In [ ]:
db = sqlite3.connect("Abhi_testing.db")

In [ ]:
Name = "Harshada"
Mobile = "45363782"
Mail = "harshada@gmail.com"

cmd = "insert into results(Name, Mobile, Mail) values ('{}','{}','{}')".format(Name,Mobile,Mail)
db.execute(cmd)
db.commit()

In [ ]:
db = sqlite3.connect("Abhi_testing.db")

In [ ]:
res = db.execute("Select * from results")
for rows in res:
  print(rows)

('Harshada', '45363782', 'harshada@gmail.com')

In [ ]:
db = sqlite3.connect("Banking1.db")
db.execute("drop table if exists results")
try:
  db.execute("create table Bank2(Name text , Account_Number text, Balance int)")
except:
  print("Already exists!")

In [ ]:
db = sqlite3.connect("Banking1.db")

In [ ]:
#n = int(input('How many customers ?'))
for i in range(4):
  Name = input("Enter the name")
  Account_Number = input("Enter account number")
  Balance = input("Balance amount")
  cmd = "insert into Bank2(Name, Account_Number,Balance) values ('{}','{}','{}')".format(Name,Account_Number,Balance)
  db.execute(cmd)
  db.commit()

Enter the nameA
Enter account number100
Balance amount10000
Enter the namePrasad
Enter account number102
Balance amount2500000
Enter the nameHarshada
Enter account number103
Balance amount200000
Enter the nameSanjog
Enter account number17
Balance amount9000000000

In [ ]:
res = db.execute("Select * from Bank2")
for rows in res:
  print(rows)

('A', '100', 10000)
('Prasad', '102', 2500000)
('Harshada', '103', 200000)
('Sanjog', '17', 9000000000)

In [ ]:
db = sqlite3.connect("Banking1.db")
qry = """
Select * from Bank2
"""
df = pd.read_sql_query(qry,db)
df.head()

       Name Account_Number     Balance
0         A            100       10000
1    Prasad            102     2500000
2  Harshada            103      200000
3    Sanjog             17  9000000000

In [ ]:
df.loc[df["Balance"]<1000]

Empty DataFrame
Columns: [Name, Account_Number, Balance]
Index: []

### Batchwise data transfer to a DB

In [ ]:
def pushtoDB(Name, Account_Number, Balance):
  db = sqlite3.connect("Banking.db")
  cmd = "insert into Bank(Name, Account_Number,Balance) values ('{}','{}','{}')".format(Name,Account_Number,Balance)
  db.execute(cmd)
  db.commit()

In [ ]:
pushtoDB("Harshada","23455","5000000")

In [ ]:
db = sqlite3.connect("Banking1.db")
qry = "Select * from Bank2 where Name = 'Harshada' "
df = pd.read_sql_query(qry,db)
df.head()

       Name Account_Number  Balance
0  Harshada            103   200000

In [ ]:
for i in range(0,len(df)):
  pushtoDB(df.iloc[i][0],df.iloc[i][1],df.iloc[i][2])

In [ ]:
df.head()

       Name Account_Number  Balance
0  Harshada          23455  5000000

In [ ]:
def update_Balance():
  name = input("Whose balance you want to update?")
  choice = input("Enter 1 for deposit and -1 for withdraw...You can withdraw or deposit 100 at a time")
  #db = sqlite3.connect("Banking1.db")
  if choice == 1 :
    qry1 = "Update Bank2 set Balance = Balance + 100 where Name = name"
    df = pd.read_sql_query(qry1,db)
  else:
    qry2 = "Update Bank2 set Balance = Balance - 100 where Name = name"
    df = pd.read_sql_query(qry2,db)
  
  cmd1 = "Select * from Bank2 where Name = name" 
  df = pd.read_sql_query(cmd1,db)
  db.execute(cmd1)
  db.commit()
  df.head() 
  
update_Balance()

Whose balance you want to update?A
Enter 1 for deposit and -1 for withdraw...You can withdraw or deposit 100 at a time1

DatabaseError: ignored